########
# Taps #
########

tap "FelixKratz/formulae"
tap "nikitabobko/tap"

##########################
# Core Development Tools #
##########################

brew "git"
brew "gh"
brew "stow"
brew "node"
brew "nvm"
brew "tree-sitter-cli"

####################
# Terminal & Shell #
####################

brew "tmux"
brew "starship"
brew "zoxide"

#######################
# Search & Navigation #
#######################

brew "fzf"
brew "ripgrep"
brew "fd"
brew "tree"

###############################
# File Viewing & Manipulation #
###############################

brew "bat"
brew "eza"
brew "jq"

################
# Editor & IDE #
################

brew "neovim"

######################
# Network & Downlods #
######################

brew "wget"
brew "curl"

#################
# Documentation #
#################

brew "tldr"

##############
# Mobile Dev #
##############

brew "watchman"
cask "android-platform-tools"

###########
# Web Dev #
###########

brew "hugo"

#####################
# Window Management #
#####################

brew "borders"

############
# GUI Apps #
############

# AI
cask "claude"
cask "claude-code"
cask "chatgpt"

# Development
cask "ghostty"
cask "zed"
cask "android-studio"
cask "postman"

# Browsers
cask "google-chrome"

# Productivity
cask "obsidian"
cask "nikitabobko/tap/aerospace"
cask "fastmail"
cask "maestral"
